#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_СоздатьРеализацию(Период, Договор) Экспорт
	
ВКМ_РеализацияАгентскихДоговоровСервер.ВКМ_СоздатьРеализацию(Период, Договор);

КонецПроцедуры

Процедура ВКМ_ВыполнитьАвтозаполнение(Документ, Договор) Экспорт
	
ВКМ_РеализацияАгентскихДоговоровСервер.ВКМ_ВыполнитьАвтозаполнение(Документ, Договор);

КонецПроцедуры

Процедура ВКМ_СозданиеАбонентскихОтгрузок(Период) Экспорт
	
ВКМ_РеализацияАгентскихДоговоровСервер.ВКМ_МассовоеСозданиеАбонентскихОтгрузок(Период);

КонецПроцедуры

#КонецОбласти