                                            #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ, Режим)

ДействующийДоговор = ПроверкаДоговора();
Если Не ДействующийДоговор Тогда
	Отказ = Истина;
КонецЕсли;

	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
		|	И НЕ ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Договора = Договор;
		Движение.Клиент = Клиент;
		Движение.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * Выборка.СтоимостьЧасаРаботы ;
	КонецЦикла;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
КонецПроцедуры


Процедура ПриЗаписи()
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	//++ Нагайцева О.А.
	//
		Если ОбменДанными.Загрузка Тогда
		Возврат;
		КонецЕсли;
		
	СообщениеВТелеграм();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//++??
Процедура СообщениеВТелеграм()
		Если ЭтоНовый() Тогда	
	ТекстИзменений = СтрШаблон("Сформирован Новый Заказ:,
	                           |Заказчик: %1,
	                           |Дата:%2;
	                           |Время: %3;	
	                           |Менеджер: %4,
	                           |Описание проблемы: %5",
	                           Клиент,
	                           Формат(ДатаПроведенияРабот,"ДФ=dd/MM/yy;"),
	                           Формат(ВремяНачалаРаботПлан,"ЧФ=; ДЛФ=T;"),
	                           Специалист,
	                           ОписаниеПроблемы);
	                           	
	КонецЕсли;
	
	
	Если Не ЭтоНовый() Тогда 
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот Как ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан Как ВремяНачалаРаботПлан,
		|	ВКМ_ОбслуживаниеКлиента.Специалист Как Специалист,
		|	ВКМ_ОбслуживаниеКлиента.Номер Как Номер
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|	И (ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот <> &ДатаПроведенияРабот
		|	ИЛИ ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан <> &ВремяНачалаРаботПлан
		|	ИЛИ ВКМ_ОбслуживаниеКлиента.Специалист <> &Специалист)"; 

		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
        Запрос.УстановитьПараметр("ДатаПроведенияРабот", ДатаПроведенияРабот); 
        Запрос.УстановитьПараметр("ВремяНачалаРаботПлан", ВремяНачалаРаботПлан); 
        Запрос.УстановитьПараметр("Специалист", Специалист); 
        
		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать(); 
		
		Если Выборка.Следующий() Тогда 
			ДатаПроведенияРаботСт = Выборка.ДатаПроведенияРабот; 
			ВремяНачалаРаботПланСт = Выборка.ВремяНачалаРаботПлан;
			СпециалистСт = Выборка.Специалист;
			НомерЗаказа = Выборка.Номер;
		КонецЕсли; 
		
	ТекстИзменений = СтрШаблон("Изменения в заказе №: %1", НомерЗаказа);	
	
	Если ДатаПроведенияРаботСт <> ДатаПроведенияРабот Тогда 
		ТекстИзмененийДата = СтрШаблон("
		                                  |Дата проведения работ:
		                                  |Было: %1
		                                  |Стало: %2",
		                                  Формат(ДатаПроведенияРаботСт,"ДФ=dd/MM/yy;"),
		                                  Формат(ДатаПроведенияРабот,"ДФ=dd/MM/yy;"));
		ТекстИзменений = ТекстИзменений + ТекстИзмененийДата;                                   
	КонецЕсли;	
	
	Если ВремяНачалаРаботПланСт <> ВремяНачалаРаботПлан Тогда 
		ТекстИзмененийВремяНачала = СтрШаблон("
		                                  |Время начала работ:
		                                  |Было: %1
		                                  |Стало: %2",
		                                  Формат(ВремяНачалаРаботПланСт,"ЧФ=; ДЛФ=T;"),
		                                  Формат(ВремяНачалаРаботПлан,"ЧФ=; ДЛФ=T;"));
		                                  
	ТекстИзменений = ТекстИзменений + ТекстИзмененийВремяНачала;  	                                   
	КонецЕсли;	
		
	Если СпециалистСт <> Специалист Тогда 
		ТекстИзмененийСпециалист = СтрШаблон("
		                                  |Назначенный специалист:
		                                  |Было: %1
		                                  |Стало: %2",
		                                  СпециалистСт,
		                                  Специалист);
		                                  
	ТекстИзменений = ТекстИзменений + ТекстИзмененийСпециалист;	                                  
	КонецЕсли;	
	
	КонецЕсли; 
	
	НовоеСообщение = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовоеСообщение.ТекстСообщения = ТекстИзменений;
	НовоеСообщение.Записать();
	
	ВКМ_Телеграм.СформироватьСообщениеТелеграм(ТекстИзменений);
	//--
КонецПроцедуры
//СформироватьСообщениеТелеграм(ТекстСообщени)
Функция ПроверкаДоговора()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор.Ссылка
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|	И ВКМ_ОбслуживаниеКлиента.Дата
		|		МЕЖДУ ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачалаДействияДоговора И ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончанияДействияДоговора
		|	И
		|		ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
			Возврат Истина;
	Иначе Сообщить("Отсутсвует действующий договор на абонентское обслуживание!");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
#КонецОбласти

#КонецЕсли
//--


