
&НаКлиенте
Процедура ПроверкаКоличестаДнейОтпуска(Команда)
	СотрудникиДляВыделения =  ПревышениеОтпуска();
	//ПодсветитьСотрудников(СотрудникиДляВыделения);
	Отбор = Новый Структура;
	Отбор.Вставить("Сотрудник", СотрудникиДляВыделения);
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
	
		Для Каждого Сотрудник Из СотрудникиДляВыделения Цикл
			Если Строка.Сотрудник = Сотрудник Тогда
			Строка.ЦветФона = Новый Цвет(0,255,0);
		КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры



&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда) 
	
    Адрес = ПоместитьВХранилище();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", Адрес);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, Элементы.ОтпускаСотрудников, );
КонецПроцедуры

&НаСервере
Функция ПоместитьВХранилище() 
	ТабЗначений = Объект.ОтпускаСотрудников.Выгрузить(); 
	Адрес = ПоместитьВоВременноеХранилище(ТабЗначений);
Возврат Адрес
КонецФункции	
//&НаКлиенте
//Процедура ОтпускаСотрудниковПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
//	
//	СотрудникиДляВыделения =  ПревышениеОтпуска();
//	ПодсветитьСотрудников(СотрудникиДляВыделения);
//	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
//	
//		Для Каждого Сотрудник Из СотрудникиДляВыделения Цикл
//			Если Строка.Сотрудник = Сотрудник Тогда
//			Строка.ЦветФона = Новый Цвет(0,255,0);
//		КонецЕсли;	
//		КонецЦикла;	
//			
//	КонецЦикла;	
//	
 //КонецПроцедуры 
 

 		
   &НаСервере
Функция ПревышениеОтпуска() 
	
	ТЗ = Объект.ОтпускаСотрудников.Выгрузить();
	
	Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    
    Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЗ ИЗ &ТЗ КАК ТЗ";
    Запрос.УстановитьПараметр("ТЗ", ТЗ);
    Запрос.Выполнить();
      
		Запрос = Новый Запрос;
	 Запрос.Текст =
	 	"ВЫБРАТЬ
	 	|	РАЗНОСТЬДАТ(ТЗ.ДатаНачала, ТЗ.ДатаОкончания, День) КАК ДнейОтпуска,
	 	|	ТЗ.Сотрудник
	 	|ПОМЕСТИТЬ ВременнаяТаблица1
	 	|ИЗ
	 	|	&ТЗ КАК ТЗ
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ
	 	|	ВременнаяТаблица1.Сотрудник
	 	|ИЗ
	 	|	ВременнаяТаблица1 КАК ВременнаяТаблица1
	 	|ГДЕ
	 	|	ВременнаяТаблица1.ДнейОтпуска > 28
	 	|СГРУППИРОВАТЬ ПО
	 	|	ВременнаяТаблица1.Сотрудник";
	
		 Запрос.УстановитьПараметр("ТЗ", ТЗ);
	 
	 РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
		
	Возврат РезультатЗапроса;
	
КонецФункции	

