
&НаКлиенте
Процедура ОтпускаСотрудниковПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Для Каждого Строка Из Элементы.ОтпускаСотрудников Цикл
		//Если
    Элементы.ОтпускаСотрудниковСотрудник.ЦветФона = Новый Цвет(0,255,0);
    ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущийЭлемент;	
КонецЦикла;
//Элемент.ЦветФона = Новый Цвет(0,255,0);

//Процедура Сформировать(Команда)
//    
//    ОтобраннаяНоменклатура = Новый Массив;
//    Для  Сч = 0 По ТаблицаЗаказа.Количество()-1 цикл              
//        Стр         = ТаблицаЗаказа[Сч];
//        ЕстьВОтборе = Элементы.ТаблицаЗаказа.ПроверитьСтроку(Сч);
//        Если ЕстьВОтборе Тогда
//            ОтобраннаяНоменклатура.Добавить(Стр.Номенклатура);
//        КонецЕсли;        
//        
//    КонецЦикла;
//    
//    СоздатьЗаявки(ОтобраннаяНоменклатура);
//    
//КонецПроцедуры

КонецПроцедуры

&НаКлиенте
//Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
//	Красный = Новый Цвет(255, 0, 0);
//	//ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущаяСтрока;
//	ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущийЭлемент;
//	Элемент.ЦветТекста = Новый Цвет(0,255,0);
//	ТекущаяСтрока.Цветфона = Красный;	
//КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущаяСтрока;
	
КонецПроцедуры


