#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	  Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	  Движения.ВКМ_Удержания.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписокСотрудников из СписокСотрудников Цикл
		
		// регистр ВКМ_ДополнительныеНачисления
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияФиксированная;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Результат = ТекСтрокаСписокСотрудников.СуммаПремии;
		Движение.Результат = Результат;
		
		// регистр ВКМ_Удержания
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		НДФЛ = ТекСтрокаСписокСотрудников.СуммаПремии*13/100; 
		Движение.Результат = НДФЛ;
		
		// регистр ВзаиморасчетыССотрудниками
   
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
        Движение.Период = Дата;
        Движение.Регистратор = Ссылка;
   		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Сумма = Результат - НДФЛ;
	КонецЦикла;
	
Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры


#КонецОбласти
#КонецЕсли
