Процедура ОбработкаПроведения(Отказ,Режим)
	

	// регистр ВКМ_ЗапланированныеОтпуска
		
	Движения.ВКМ_ЗапланированныеОтпуска.Записывать = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
		|	РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания,
		|		День) КАК ДнейОтпуска
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка );
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	    Движение = Движения.ВКМ_ЗапланированныеОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		//Движение.ДатаНачала = Выборка.ДатаНачала;
	//	Движение.ДатаОкончания = Выборка.ДатаОкончания;
		Движение.КоличествоДнейОтпуска = Выборка.ДнейОтпуска;
		
	КонецЦикла;
	

	
КонецПроцедуры