#Область ОбработчикиСобытийФормы

// ++ Нагайцева
//Видимость реквизитов Абоненского договора

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВКМ_ВидимостьРеквизитовАбонентскогодоговора();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
		ВКМ_ВидимостьРеквизитовАбонентскогодоговора();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВКМ_ВидимостьРеквизитовАбонентскогодоговора()
	АбонентскийДоговор = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	Если Объект.ВидДоговора = АбонентскийДоговор Тогда
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина;
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Доступность = Истина;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Доступность = Истина;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Доступность = Истина;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Доступность = Истина;
	Иначе
	Объект.ВКМ_ДатаНачалаДействияДоговора = "";
	Объект.ВКМ_ДатаОкончанияДействияДоговора = "";
	Объект.ВКМ_СтоимостьЧасаРаботы = 0;
	Объект.ВКМ_СуммаАбонентскойПлаты = 0;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Доступность = Ложь;	
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Доступность = Ложь;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Доступность = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

//--
