
&НаКлиенте
Процедура СоздатьАкты(Команда)
	ДлительнаяОперация = ВыполнитьДлительнуюОперацию();	
			//СоздатьАктыНаСервере();
	Оповещение = Новый ОписаниеОповещения("ФункцияВыполнена", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение);	
КонецПроцедуры

//&НаКлиенте
//Процедура СоздатьАкты(Команда)
	//ДлительнаяОперация = ВыполнитьДлительнуюОперацию();	
	//СоздатьАктыНаСервере();
	//Оповещение = Новый ОписаниеОповещения("ФункцияВыполнена", ЭтотОбъект);
	//ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение);	
//КонецПроцедуры

&НаСервере
Функция ВыполнитьДлительнуюОперацию()

ДатаНачала = Объект.Период.ДатаНачала;
ДатаОкончания = Объект.Период.ДатаОкончания;
ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
	                    "ВКМ_РеализацияАгентскихДоговоровВызовСервера.ВКМ_СозданиеАбонентскихОтгрузок", ДатаНачала, ДатаОкончания);
	                    
	                    	//ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(УникальныйИдентификатор, 
	                  //  "ВКМ_РеализацияАгентскихДоговоровВызовСервера.ВКМ_СозданиеАбонентскихОтгрузок", ДатаНачала, ДатаОкончания);

Возврат ДлительнаяОперация;
КонецФункции

//&НаСервере
//Процедура ВыполнитьДлительнуюОперацию(Договор)
//
//ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(УникальныйИдентификатор,
//                        "ВКМ_РеализацияАгентскихДоговоровВызовСервера.ВКМ_СоздатьРеализацию", Договор);
//КонецПроцедуры

&НаКлиенте
Процедура ФункцияВыполнена(Результат, ДополнительныеПараметры) Экспорт
		Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
		КонецЕсли;
		РезультатДлительнойОперации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выполнено");
		ТабДок = Новый ТабличныйДокумент;
		ТабДок = РезультатДлительнойОперации;
		Объект.ТабличнаяЧасть= ТабДок;
КонецПроцедуры

//&НаСервере
//Процедура СоздатьАктыНаСервере()
//
//Запрос = Новый Запрос;
//Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ДоговорыКонтрагентов.Ссылка,
//	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты,
//	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы
//	|ПОМЕСТИТЬ ВТ_ДействующиеАбоненскиеДоговора
//	|ИЗ
//	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
//	|ГДЕ
//	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
//	|	И (ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &НачалоМесяца
//	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &КонецМесяца)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РеализацияТоваровУслуг.Ссылка,
//	|	РеализацияТоваровУслуг.Договор.Ссылка
//	|ПОМЕСТИТЬ ВТ_РеализацииАбоненские
//	|ИЗ
//	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
//	|ГДЕ
//	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
//	|	И
//	|		РеализацияТоваровУслуг.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
//	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|
//	|	ВТ_ДействующиеАбоненскиеДоговора.Ссылка КАК Договор,
//	|	ВТ_ДействующиеАбоненскиеДоговора.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
//	|	ВТ_ДействующиеАбоненскиеДоговора.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
//	|	ЕСТЬNULL(ВТ_РеализацииАбоненские.Ссылка, ""Пусто"") КАК Реализация
//	|ИЗ
//	|	ВТ_ДействующиеАбоненскиеДоговора КАК ВТ_ДействующиеАбоненскиеДоговора
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацииАбоненские КАК ВТ_РеализацииАбоненские
//	|		ПО ВТ_ДействующиеАбоненскиеДоговора.Ссылка = ВТ_РеализацииАбоненские.ДоговорСсылка";
//
//Запрос.УстановитьПараметр("НачалоМесяца", Объект.Период.ДатаНачала);
//Запрос.УстановитьПараметр("КонецМесяца", Объект.Период.ДатаОкончания);
//
//РезультатЗапроса = Запрос.Выполнить();
//
//Выборка = РезультатЗапроса.Выбрать();
//
//Пока Выборка.Следующий() Цикл
//	
//	 Если Выборка.Реализация = "Пусто" Тогда
//	 //создаем реализацию 
//	ДоговорСсылка = Выборка.Договор;
////	ДокументСсылка = Выборка.Реализация;
////	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
////  ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение(Объект);
//  
//  ВыполнитьДлительнуюОперацию(ДоговорСсылка);
//  //ДлительнаяОперация(Объект.Период, ДоговорСсылка); 
//  //ВКМ_РеализацияАгентскихДоговоровВызовСервера.ВКМ_СоздатьРеализацию(Объект.Период, ДоговорСсылка);
//    
//   КонецЕсли;
//Таблица = Объект.ТабличнаяЧасть;
//НоваяСтрока = Таблица.Добавить();
//НоваяСтрока.Договор = Выборка.Договор;
//НоваяСтрока.Реализация = Выборка.Реализация;
//КонецЦикла;
//
//КонецПроцедуры


